{
  "common": {
    "name": "heatingcontrol",
    "version": "3.0.3",
    "news": {
      "3.0.3": {
        "en": "see issue #723: The OIDs selected in the OID selection dialog were not saved.\nbug fix: use correct actor ID\nbug fix: OID-Path for Path2HolidayPresentDP now taken from old version\nold device structure deleted after migration to avoid double import",
        "de": "siehe Ausgabe #723: Die im OID Auswahldialog ausgewählten OIDs wurden nicht gespeichert.\nfehlerbehebung: Verwenden Sie korrekte Aktor-ID\nfehlerbehebung: OID-Path für Path2Holiday Gegenwart DP jetzt aus der alten Version\nalte gerätestruktur nach der migration gelöscht, um doppelimport zu vermeiden",
        "ru": "проблема No 723: ОИД, выбранные в диалоге выбора ОИД, не были сохранены.\nисправление ошибок: используйте правильный идентификатор актера\nисправление ошибок: Обсуждение Path2Holiday Презентация DP теперь взят из старой версии\nстарая структура устройства удалена после миграции, чтобы избежать двойного импорта",
        "pt": "ver problema #723: Os OIDs selecionados na janela de seleção do OID não foram salvos.\ncorreção de erros: usar o ID correto do ator\ncorreção de erros: Caminho OID para o Caminho2Holiday Presente DP agora retirado da versão antiga\nestrutura antiga do dispositivo apagada após a migração para evitar a importação dupla",
        "nl": "zie probleem #723: De OID's die geselecteerd zijn in het OID-selectievenster zijn niet opgeslagen.\nbug fix: gebruik de juiste actor ID\nbugfix: OID-pad voor Path2Holiday Aanwezig DP nu genomen van oude versie\noude apparaatstructuur verwijderd na migratie om dubbele import te voorkomen",
        "fr": "voir le numéro 723 : Les OID sélectionnés dans la boîte de dialogue de sélection de l'OID n'ont pas été enregistrés.\ncorrection du bug : utiliser l'identifiant de l'acteur correct\ncorrection du bug & #160;: OID-Path pour Path2Holiday Présent DP maintenant pris de l'ancienne version\nstructure ancienne du dispositif supprimé après la migration pour éviter une double importation",
        "it": "vedi problema #723: I OID selezionati nella finestra di dialogo di selezione OID non sono stati salvati.\nbug fix: utilizzare corretto attore ID\ncorrezione bug: OID-Path per Path2Holiday Presente DP ora preso dalla vecchia versione\nvecchia struttura del dispositivo cancellato dopo la migrazione per evitare doppio importazione",
        "es": "ver número #723: Los OID seleccionados en el diálogo de selección OID no fueron guardados.\nbug fix: use correct actor ID\nbug fix: OID-Path para Path2Holiday Presente DP now taken from old version\nantigua estructura del dispositivo eliminada después de la migración para evitar la doble importación",
        "pl": "zobacz numer # 723: OID wybrane w oknie wyboru OID nie zostały zapisane.\nfix: użyj poprawnego identyfikatora aktora\npoprawka błędu: OID- Path for Path2Holiday Obecny DP teraz wzięte ze starej wersji\nstara struktura urządzenia usunięta po migracji, aby uniknąć podwójnego importu",
        "uk": "див. питання #723: Вибрані OID у діалоговому вікні вибору OID не збережені.\nвиправлення помилок: використовувати правильний актор ID\nвиправлення помилок: OID-Path для Path2Holiday Головна DP тепер приймається з старої версії\nстара структура пристрою видалена після міграції, щоб уникнути подвійний імпорт",
        "zh-cn": "参见第 723 期: OID 选择对话框中选择的 OID 未保存 .\n错误修复: 使用正确的演员标识\n错误修正 : Path2Holiday 的 OID- 路径 现 DP 现在取自旧版本\n迁移后删除旧设备结构以避免重复导入"
      },
      "3.0.2": {
        "en": "*not yet recommended for production use. beta test only**\nbug fix: room selection, refresh configuration display for inactive rooms",
        "de": "*noch nicht für den produktionseinsatz empfohlen. nur beta-test**\nbugfix: zimmerauswahl, konfigurationsanzeige für inaktive zimmer",
        "ru": "*не рекомендуется для использования в производстве. только бета-тестирование**\nисправление ошибок: выбор комнаты, дисплей конфигурации обновления для неактивных комнат",
        "pt": "*ainda não recomendado para a produção. apenas teste beta**\ncorreção de bug: seleção de sala, exibição de configuração de atualização para salas inativas",
        "nl": "*nog niet aanbevolen voor productie gebruik. uitsluitend bètatest *\nbug fix: kamerselectie, configuratiescherm vernieuwen voor inactieve kamers",
        "fr": "*pas encore recommandé pour l'utilisation de la production. essai bêta seulement**\ncorrection du bug : sélection de la pièce, affichage de configuration de rafraîchissement pour les pièces inactives",
        "it": "*non ancora consigliato per uso di produzione. test beta solo* #\ncorrezione bug: selezione della camera, visualizzazione di configurazione di aggiornamento per le camere inattive",
        "es": "*aún no recomendado para el uso de la producción. prueba de beta únicamente**\ncorrección de errores: selección de habitaciones, pantalla de configuración de actualización para habitaciones inactivas",
        "pl": "*nie jest jeszcze zalecane do produkcji. tylko test beta **\nnaprawianie błędów: wybór pokoju, wyświetlacz konfiguracji odświeżania dla nieaktywnych pokoi",
        "uk": "*ще не рекомендується використовувати для виробництва. бета тест тільки* ім'я*\nвиправлення помилок: вибір приміщення, дисплей конфігурації оновлень для неактивних кімнат",
        "zh-cn": "* 尚未建议用于生产。 仅β试验* * 《大会正式记录,第五十八届会议,补编第5号》(a/c.6/61/rev.1)\n错误修补: 房间选择, 非活动房间刷新配置显示"
      },
      "3.0.1": {
        "en": "*not yet recommended for production use. beta test only**\nbug fix: added missing OID configurations for public holiday and holidays at home\nbug fix: 'function' for device search will be saved now\npreselect 'function' and 'selected room' if nothing was selected / stored before",
        "de": "*noch nicht für den produktionseinsatz empfohlen. nur beta-test**\nbugfix: hinzugefügt fehlende OID-Konfigurationen für Feiertage und Ferien zu Hause\nfehlerbehebung: 'funktion' für gerätesuche wird jetzt gespeichert\n\"funktion\" und \"ausgewähltes zimmer\" vorwählen, wenn vorher nichts ausgewählt / gespeichert wurde",
        "ru": "*не рекомендуется для использования в производстве. только бета-тестирование**\nисправление ошибок: добавлены недостающие конфигурации OID для государственных праздников и праздников дома\nисправление ошибок: «функция» для поиска устройств будет сохранена\nпредварительно выбранная «функция» и «выбранная комната», если до этого ничего не было выбрано или сохранено",
        "pt": "*ainda não recomendado para a produção. apenas teste beta**\ncorreção de bug: adicionadas configurações OID ausentes para férias públicas e feriados em casa\ncorreção de bug: 'function' para a pesquisa do dispositivo será salva agora\npreselect 'function' e 'select room' se nada foi seleccionado / armazenado antes",
        "nl": "*nog niet aanbevolen voor productie gebruik. uitsluitend bètatest *\nbug fix: ontbrekende OID configuraties toegevoegd voor feestdagen en feestdagen thuis\nbugfix: 'functioneel' voor het zoeken naar een apparaat wordt nu opgeslagen\nvoorselecteer 'function' en 'selected room' als er niets is geselecteerd / opgeslagen voor",
        "fr": "*pas encore recommandé pour l'utilisation de la production. essai bêta seulement**\nbug fix: ajout de configurations OID manquantes pour les jours fériés et les jours fériés à la maison\ncorrection du bug: 'fonction' pour la recherche de périphérique sera sauvegardée maintenant\nprésélectionner 'fonction' et 'chambre sélectionnée' si rien n'a été sélectionné / stocké avant",
        "it": "*non ancora consigliato per uso di produzione. test beta solo* #\nbug fix: aggiunte configurazioni OID mancanti per le vacanze pubbliche e le vacanze a casa\ncorrezione bug: 'funzione' per la ricerca del dispositivo verrà salvato ora\nse nulla è stato selezionato / memorizzato prima",
        "es": "*aún no recomendado para el uso de la producción. prueba de beta únicamente**\nbug fix: añadido configuraciones OID desaparecidas para vacaciones públicas y vacaciones en casa\nbug fix: 'función' para la búsqueda del dispositivo se guardará ahora\npreseleccionar 'función' y 'seleccionado habitación' si nada fue seleccionado / almacenado antes",
        "pl": "*nie jest jeszcze zalecane do produkcji. tylko test beta **\nfix bug: dodano brakujące konfiguracje OID na święta publiczne i wakacje w domu\nbug fix: 'funkcja' dla wyszukiwania urządzeń zostanie teraz zapisany\npreselekcjonuj 'funkcja' i 'wybrany pokój' jeśli nic nie zostało wcześniej wybrane / zapisane",
        "uk": "*ще не рекомендується використовувати для виробництва. бета тест тільки* ім'я*\nвиправлення помилок: додано відсутні налаштування OID для громадського відпочинку та відпочинку в домашніх умовах\nвиправлення помилок: 'function' для пошуку пристрою буде збережено зараз\nпередпродаж 'function' і 'selected room' якщо нічого не було вибрано / зберігаються до",
        "zh-cn": "* 尚未建议用于生产。 仅β试验* * 《大会正式记录,第五十八届会议,补编第5号》(a/c.6/61/rev.1)\n错误修正: 为家用公共假日和节假日添加缺失的 OID 配置\n错误修正: 设备搜索的“ 功能 ” 现在将被保存\n预选“ 函数” 和“ 选定房间 ” 如果未选择任何功能 / 存储在之前"
      },
      "3.0.0": {
        "en": "**not yet recommended for production use. beta test only**\n* admin overworked completely with react and vite. **ATTENTION**: breaking changes in admin settings !!!\n\t\tRooms can no longer be created manually. Only rooms that are generally configured in ioBrooker are used.\n\t\tThe adapter attempts to migrate the configuration, but this cannot be guaranteed in any case.\n* csv-logging: path changed, one log per room now\n* always enable CopyProfile buttons\n* Refactor SetVis function to improve readability and maintainability",
        "de": "** noch nicht für den Produktionseinsatz empfohlen. nur beta-test* *\n* Admin komplett mit Reakt und Vite überarbeitet. **Achtung**: Änderungen in Admin-Einstellungen geändert !!!\nDie Räume können nicht mehr manuell erstellt werden. Es werden nur Räume verwendet, die global in ioBrooker konfiguriert sind.\nDer Adapter versucht, die Konfiguration zu migrieren, aber dies kann nicht in jedem Fall gewährleistet werden.\n* csv-logging: Pfad geändert, ein Protokoll pro Raum\n* CopyProfile ist jetzt immer aktiviert\n* Refactor SetVis Funktion zur Verbesserung der Lesbarkeit und Wartbarkeit",
        "ru": "** не рекомендуется для использования в производстве. только бета-тестирование* *\n* админ перегружен полностью реакцией и добротой. ** ВНИМАНИЕ**: изменение настроек администратора!!!\nКомнаты больше нельзя создавать вручную. Используются только комнаты, которые обычно настроены в ioBrooker.\nАдаптер пытается перенести конфигурацию, но это ни в коем случае нельзя гарантировать.\ncsvlogging: путь изменился, теперь один журнал на комнату\n* Всегда включайте кнопки CopyProfile\n* Функция Refactor SetVis улучшает читаемость и ремонтопригодность",
        "pt": "** ainda não recomendado para utilização na produção. apenas teste beta* *\n* admin sobrecarregado completamente com reação e vite. ** ATENÇÃO**: quebrando alterações nas configurações de administrador !!!\nOs quartos já não podem ser criados manualmente. Apenas são utilizados quartos que são geralmente configurados no ioBrooker.\nO adaptador tenta migrar a configuração, mas isso não pode ser garantido em nenhum caso.\n* csv-logging: caminho alterado, um log por quarto agora\n* Ativar sempre os botões CopiarPerfil\n* Refactor SetVis função para melhorar a legibilidade e manutenção",
        "nl": "**nog niet aanbevolen voor productiegebruik. uitsluitend bètatest *\n* admin overwerkt volledig met reactie en vite. **Opmerking**: wijzigingen in admin instellingen breken !!!\nRuimtes kunnen niet meer handmatig worden aangemaakt. Alleen kamers die over het algemeen zijn geconfigureerd in ioBrooker worden gebruikt.\nDe adapter probeert de configuratie te migreren, maar dit kan in geen geval worden gegarandeerd.\n* csv-logging: pad veranderd, een log per kamer nu\n* altijd CopyProfile-knoppen inschakelen\n* Refactor SetVis functie om leesbaarheid en onderhoud te verbeteren",
        "fr": "** pas encore recommandé pour l'utilisation de la production. essai bêta seulement* *\n* administrateur surchargé complètement avec réaction et rite. **ATTENTION**: casser les changements dans les paramètres d'administration !!!\nLes chambres ne peuvent plus être créées manuellement. Seules les pièces généralement configurées en ioBrooker sont utilisées.\nL'adaptateur tente de migrer la configuration, mais cela ne peut en aucun cas être garanti.\n* csv-logging: chemin changé, un journal par chambre maintenant\n* activer toujours les boutons CopyProfile\n* Refactor SetVis fonction pour améliorer la lisibilité et la maintenance",
        "it": "** non ancora consigliato per uso di produzione. test beta solo* #\n* admin ha lavorato completamente con reagire e vite. **ATTENZIONE**: rompere i cambiamenti nelle impostazioni di amministrazione!\nLe camere non possono più essere create manualmente. Solo le camere che sono generalmente configurate in ioBrooker sono utilizzate.\nL'adattatore tenta di migrare la configurazione, ma questo non può essere garantito in ogni caso.\n* csv-logging: percorso cambiato, un log per stanza ora\n* abilita sempre i pulsanti CopyProfile\n* Funzione Refactor SetVis per migliorare la leggibilità e la manutenbilità",
        "es": "**no se recomienda todavía para uso de la producción. prueba de beta únicamente* *\n* admin superó completamente el trabajo con reacción y vite. **ATENCIÓN**: romper cambios en la configuración de administración !!!\nLas habitaciones ya no se pueden crear manualmente. Sólo se utilizan habitaciones que generalmente están configuradas en ioBrooker.\nEl adaptador intenta migrar la configuración, pero esto no puede garantizarse en ningún caso.\n* csv-logging: camino cambiado, un registro por habitación ahora\n* siempre activa los botones CopyProfile\n* Refactor SetVis función para mejorar la legibilidad y mantenimiento",
        "pl": "** nie jest jeszcze zalecane do stosowania w produkcji. tylko test beta **\n* admin przepracował całkowicie z reakcji i vite. ** UWAGA* *: łamanie zmian w ustawieniach administratora!!! \nPokoje nie mogą być już tworzone ręcznie. Używane są tylko pokoje, które są na ogół skonfigurowane w joBrooker.\nAdapter próbuje przenieść konfigurację, ale w żadnym wypadku nie można tego zagwarantować.\n* csv- logowanie: ścieżka zmieniona, jeden log na pokój teraz\n* zawsze włącza przyciski CopyProfile\n* Funkcja Refactor SetVis w celu poprawy czytelności i utrzymania",
        "uk": "**не рекомендується використовувати для виробництва. бета тест тільки* ім'я *\n* адмін перероблений повністю з реагацією і вітом. **ATTENTION***: зміни в налаштуваннях адміністратора !!!\nНомери не можуть бути створені вручну. використовуються тільки номери, які, як правило, налаштовані в ioBrooker.\nПерехідник намагається намітити конфігурацію, але це не гарантується в будь-якому випадку.\n* csv-log: зміна шляху, один журнал за номер зараз\n* завжди ввімкніть кнопку Копіювання\n* Функція Refactor SetVis для поліпшення читабельності та стійкості",
        "zh-cn": "** 尚未建议用于生产。 仅β试验* * 《大会正式记录,第五十八届会议,补编第5号》(a/c.6/61/rev.1)\n* 处理过度,完全与反应和葡萄酒。 校对:Soup!\n房间无法再手动创建. 仅使用通常在ioBrooker中配置的房间.\n适配器试图迁移配置,但这在任何情况下都无法保证.\n* csv-logy:路径改变,现在每个房间一个日志\n* 总是启用 CopyProfile 按钮\n* 调整Setvis功能,以提高可读性和可维护性"
      },
      "2.12.19": {
        "en": "csv-logging added (optionally), will be used in later enhancements",
        "de": "csv-logging hinzugefügt (optional), wird in späteren verbesserungen verwendet",
        "ru": "csv-логирование добавлено (необязательно), будет использоваться в последующих улучшениях",
        "pt": "csv-logging adicionado (opcionalmente), será usado em melhorias posteriores",
        "nl": "csv-logging toegevoegd (optioneel), zal worden gebruikt in latere verbeteringen",
        "fr": "csv-logging ajouté (en option), sera utilisé dans les améliorations ultérieures",
        "it": "csv-logging aggiunto (opzionale), sarà utilizzato in miglioramenti successivi",
        "es": "csv-logging añadido (opcionalmente), se utilizará en mejoras posteriores",
        "pl": "csv- logowanie dodane (opcjonalnie), będą stosowane w późniejszych ulepszeniach",
        "uk": "csv-log додано (необов'язково), буде використовуватися в більш пізніх розширень",
        "zh-cn": "添加csv-logy(可选),用于以后的增强"
      },
      "2.12.18": {
        "en": "bug fix sentry",
        "de": "Fehlerbehebung sentry",
        "ru": "исправлять ошибки",
        "pt": "corrigir o erro sentinela",
        "nl": "bug repareren wacht",
        "fr": "correction du bug sentinelle",
        "it": "bug fix sendry",
        "es": "bug fix centry",
        "pl": "bug fix sentry",
        "uk": "виправлення помилок",
        "zh-cn": "错误修正哨兵"
      },
      "2.12.17": {
        "en": "changes requested by adapter checker",
        "de": "Änderungen, die von Adapter-Checker angefordert werden",
        "ru": "изменения, запрошенные adapter checker",
        "pt": "alterações solicitadas pelo verificador de adaptadores",
        "nl": "wijzigingen gevraagd door adaptercontrole",
        "fr": "modifications demandées par l'adaptateur checker",
        "it": "modifiche richieste da adattatore checker",
        "es": "cambios solicitados por el adaptador",
        "pl": "zmiany wymagane przez sprawdzacz adaptera",
        "uk": "зміни, які вимагаються перевіркою адаптера",
        "zh-cn": "适配器检查器要求的更改"
      }
    },
    "titleLang": {
      "en": "Heating Control",
      "de": "Heizungsregelung",
      "ru": "Управление отоплением",
      "pt": "Controle de aquecimento",
      "nl": "Verwarmingregeling",
      "fr": "Contrôle du chauffage",
      "it": "Controllo del riscaldamento",
      "es": "Control de calentamiento",
      "pl": "Kontrola ogrzewania",
      "zh-cn": "加热控制",
      "uk": "Контроль опалення"
    },
    "desc": {
      "en": "Heating Control",
      "de": "Heizungsregelung",
      "ru": "Управление отоплением",
      "pt": "Controle de aquecimento",
      "nl": "Verwarmingregeling",
      "fr": "Contrôle du chauffage",
      "it": "Controllo del riscaldamento",
      "es": "Control de calentamiento",
      "pl": "Kontrola ogrzewania",
      "zh-cn": "加热控制",
      "uk": "Контроль опалення"
    },
    "platform": "Javascript/Node.js",
    "mode": "daemon",
    "icon": "heatingcontrol.png",
    "enabled": true,
    "messagebox": true,
    "extIcon": "https://raw.githubusercontent.com/rg-engineering/ioBroker.heatingcontrol/master/admin/heatingcontrol.png",
    "keywords": [
      "heating"
    ],
    "readme": "https://github.com/rg-engineering/ioBroker.heatingcontrol/blob/master/README.md",
    "loglevel": "info",
    "stopBeforeUpdate": true,
    "type": "climate-control",
    "tier": 1,
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "dependencies": [
      {
        "js-controller": ">=6.0.11"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.6.17"
      }
    ],
    "plugins": {
      "sentry": {
        "dsn": "https://5799cf9f70cb43c7a761192a5f35d419@o390433.ingest.sentry.io/5434781"
      }
    },
    "compact": true,
    "authors": [
      {
        "name": "René G.",
        "email": "info@rg-engineering.eu"
      }
    ],
    "connectionType": "local",
    "dataSource": "push",
    "adminUI": {
      "config": "materialize"
    },
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.0.0",
            "newVersion>=3.0.0"
          ]
        },
        "title": {
          "en": "!!! breaking change: configuration of devices / rooms must be done again",
          "de": "!!! Wichtige Änderung: Die Konfiguration der Geräte/Räume muss erneut durchgeführt werden.",
          "ru": "!!! критическое изменение: настройку устройств/комнат необходимо выполнить заново",
          "pt": "!!! alteração significativa: a configuração de dispositivos/salas deve ser feita novamente",
          "nl": "!!! belangrijke wijziging: de configuratie van apparaten/kamers moet opnieuw worden uitgevoerd",
          "fr": "!!! changement avec rupture : la configuration des appareils/pièces doit être refaite",
          "it": "!!! modifica sostanziale: la configurazione dei dispositivi/stanze deve essere eseguita nuovamente",
          "es": "!!! Cambio importante: la configuración de dispositivos/salas debe realizarse nuevamente.",
          "pl": "!!! przełomowa zmiana: konfigurację urządzeń/pomieszczeń należy przeprowadzić od nowa",
          "uk": "!!! зміна порушення: конфігурація пристроїв / кімнат повинна бути виконана знову",
          "zh-cn": "!!!尚未推荐用于生产用途！重大更改：必须重新配置设备/房间"
        },
        "text": {
          "en": "Due to the redesign of the administration interface in React, the configuration structure has changed. Devices/rooms must be reconfigured. While the adapter attempts to migrate the data, this cannot be guaranteed. Important: It is no longer possible to create rooms in the adapter. Instead, globally created rooms from the categories will be used.",
          "de": "Aufgrund der Neuentwicklung der Administrationsoberfläche in React hat sich die Konfigurationsstruktur geändert. Geräte/Räume müssen erneut konfiguriert werden. Der Adapter versucht zwar, die Daten zu migrieren, das kann aber nicht garantiert werden. Wichtig: Es können keine Räume im Adapter mehr angelegt werden. Stattdessen werden die global angelegten Räume aus den Kategorien verwendet",
          "ru": "В связи с редизайном интерфейса администрирования в React изменилась структура конфигурации. Устройства/комнаты необходимо переконфигурировать. Хотя адаптер пытается перенести данные, это не может быть гарантировано. Важно: в адаптере больше нельзя создавать комнаты. Вместо этого будут использоваться глобально созданные комнаты из категорий.",
          "pt": "Devido ao redesenho da interface de administração do React, a estrutura de configuração mudou. Dispositivos/salas devem ser reconfigurados. Embora o adaptador tente migrar os dados, isso não pode ser garantido. Importante: Não é mais possível criar ambientes no adaptador. Em vez disso, serão utilizadas salas criadas globalmente a partir das categorias.",
          "nl": "Door het herontwerp van de beheerinterface in React is de configuratiestructuur veranderd. Apparaten/kamers moeten opnieuw worden geconfigureerd. Hoewel de adapter probeert de gegevens te migreren, kan dit niet worden gegarandeerd. Belangrijk: Het is niet langer mogelijk om kamers in de adapter te creëren. In plaats daarvan worden globaal aangemaakte kamers uit de categorieën gebruikt.",
          "fr": "En raison de la refonte de l'interface d'administration dans React, la structure de configuration a changé. Les appareils/pièces doivent être reconfigurés. Même si l'adaptateur tente de migrer les données, cela ne peut pas être garanti. Important : Il n'est plus possible de créer des pièces dans l'adaptateur. Au lieu de cela, les salles créées globalement à partir des catégories seront utilisées.",
          "it": "A causa della riprogettazione dell'interfaccia di amministrazione in React, la struttura di configurazione è cambiata. I dispositivi/stanze devono essere riconfigurati. Mentre l'adattatore tenta di migrare i dati, ciò non può essere garantito. Importante: non è più possibile creare stanze nell'adattatore. Verranno invece utilizzate le stanze create globalmente dalle categorie.",
          "es": "Debido al rediseño de la interfaz de administración en React, la estructura de configuración ha cambiado. Los dispositivos/salas deben reconfigurarse. Mientras el adaptador intenta migrar los datos, esto no se puede garantizar. Importante: Ya no es posible crear habitaciones en el adaptador. En su lugar, se utilizarán salas creadas globalmente a partir de las categorías.",
          "pl": "W związku z przeprojektowaniem interfejsu administracyjnego w React zmieniła się struktura konfiguracji. Należy ponownie skonfigurować urządzenia/pokoje. Chociaż adapter podejmuje próbę migracji danych, nie można tego zagwarantować. Ważne: Nie można już tworzyć pomieszczeń w adapterze. Zamiast tego zostaną użyte pokoje utworzone globalnie z kategorii.",
          "uk": "Через редизайн інтерфейсу адміністрування в React змінилася структура конфігурації. Пристрої/кімнати необхідно переналаштувати. Поки адаптер намагається перенести дані, це не можна гарантувати. Важливо: більше неможливо створювати кімнати в адаптері. Замість цього будуть використовуватися глобально створені кімнати з категорій.",
          "zh-cn": "由于React中管理界面的重新设计，配置结构发生了变化。设备/房间必须重新配置。当适配器尝试迁移数据时，这不能得到保证。重要提示：无法再在适配器中创建房间。相反，将使用类别中全局创建的房间。"
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "native": {
    "devices": [],
    "rooms": [],
    "UseActors": false,
    "Gewerk": "Heizung",
    "ProfileType": 1,
    "NumberOfProfiles": 1,
    "NumberOfPeriods": 5,
    "timezone": "Europe/Berlin",
    "UseActorsIfNotHeating": 1,
    "UseActorsIfNoThermostat": 1,
    "Path2FeiertagAdapter": "",
    "Path2PresentDP": "",
    "PublicHolidayLikeSunday": true,
    "UseFixHeatingPeriod": false,
    "FixHeatingPeriodStart": "01.10.",
    "FixHeatingPeriodEnd": "31.03.",
    "TemperatureDecrease": 3,
    "Path2VacationDP": "",
    "Path2HolidayPresentDP": "",
    "Path2GuestsPresentDP": "",
    "Path2PresentDPType": 1,
    "Path2PartyNowDP": "",
    "SensorOpenDelay": 0,
    "UseMinTempPerRoom": false,
    "ThermostatModeIfNoHeatingperiod": 3,
    "FixTempIfNoHeatingPeriod": "15;",
    "UseChangesFromThermostat": 1,
    "UseVisFromPittini": false,
    "SensorCloseDelay": 0,
    "PittiniPathImageWindowOpen": "",
    "PittiniPathImageWindowClosed": "",
    "ActorBeforeOnDelay": 0,
    "ActorBeforeOffDelay": 0,
    "Path2PresentDPLimit": 0,
    "Path2GuestsPresentDPType": 1,
    "Path2GuestsPresentDPLimit": 0,
    "Path2PartyNowDPType": 1,
    "Path2PartyNowDPLimit": 0,
    "VisMinProfilTemp": 12,
    "VisMaxProfilTemp": 30,
    "VisStepWidthProfilTemp": 1,
    "VisUseSimple": false,
    "HolidayPresentLikeSunday": true,
    "ExtendOverride": false,
    "ThermostatHandlesWindowOpen": false,
    "VisMinDecRelTemp": 1,
    "VisMaxDecRelTemp": 10,
    "VisStepWidthDecRelTemp": 1,
    "VisMinDecAbsTemp": 1,
    "VisMaxDecAbsTemp": 25,
    "VisStepWidthDecAbsTemp": 1,
    "VisMinOverrideTemp": 20,
    "VisMaxOverrideTemp": 30,
    "VisStepWidthOverrideTemp": 1,
    "UseAddTempSensors": false,
    "OverrideMode": 1,
    "UseFireplaceMode": false,
    "UseFireplaceModeResetAt": "22:00",
    "MaintenanceModeTemperature": 32,
    "AddTempSensorsTempLimit": 4,
    "AddTempSensorsMaxTimeDiff": 30,
    "regulatorType": 1,
    "InterActorDelay": 0,
    "InterThermostatDelay": 0,
    "extendedInfoLogTemperature": false,
    "extendedInfoLogActor": false,
    "extendedInfoLogWindow": false,
    "ExtHandlingActorRepTime": 10000,
    "ExtHandlingActorAckWaitTime": 2000,
    "notificationEnabled": false,
    "notificationsType": "Telegram",
    "telegramInstance": "telegram.0",
    "telegramNoticeType": "longTelegramNotice",
    "telegramUser": "All Receiver",
    "telegramSilentNotice": false,
    "telegramOnlyError": false,
    "telegramWaitToSend": 0,
    "whatsappInstance": "whatsapp-cmb.0",
    "whatsappNoticeType": "longWhatsappNotice",
    "whatsappOnlyError": false,
    "whatsappWaitToSend": 0,
    "signalInstance": "signal-cmb.0",
    "signalNoticeType": "longSignalNotice",
    "signalOnlyError": false,
    "signalWaitToSend": 0,
    "pushoverInstance": "pushover.0",
    "pushoverNoticeType": "longPushoverNotice",
    "pushoverSilentNotice": false,
    "pushoverDeviceID": "",
    "pushoverOnlyError": false,
    "pushoverWaitToSend": 0,
    "emailReceiver": "xxx@xxx.com",
    "emailSender": "xxx@xxx.com",
    "emailInstance": "email.0",
    "emailNoticeType": "longEmailNotice",
    "emailOnlyError": false,
    "emailWaitToSend": 0,
    "notificationsTemperature": false,
    "notificationsActor": false,
    "notificationsWindow": false,
    "enableCSVLogging": false
  }
}
